{
	"bios": [
		{
			"name": "Jami Berry",
			"bio": "Jami Berry is a clinical associate professor and educational leadership program coordinator at Georgia State University. As a clinical faculty member, her primary responsibilities include serving as a course instructor and student advisor within the educational leadership program. Additionally, she oversees the Professional Doctorate of Education in Educational Leadership (Ed.D.), an executive, hybrid degree program that is Georgia’s most innovative doctoral degree for educational leaders. She has received numerous grants for her statewide, national, and international work around the development and enhancement of preparation programs and professional development for educational leaders.  Prior to her university service, Dr. Berry was a music teacher and elementary school administrator. She remains active in K-12 education through volunteering in schools and serving as a board member for several education organizations. Her proudest roles are as wife to Frank and mom to her daughters, Dory, a student at Eastside High School, and Mia, a student at NCTS."
		},
		{
			"name": "Hillary Edgar",
			"bio": "Hillary Edgar is a Partner with the law firm of Alexander Royston, LLP, in Covington.  She assists clients with real estate and probate litigation, estate planning, adoption, business planning and small business transactions.  She has practiced before the Georgia Court of Appeals and Georgia Supreme Court.  In addition to serving on the Foundation Board, Hillary is active in many professional and civic groups including the Covington/Newton Chamber of Commerce (current Chair of the Board of Directors), Kiwanis Club of Covington (Board of Directors and former President), First Baptist Church of Covington (current member of the Long Range Planning Committee and former member of the Budget and Finance Committee), and the Newton College and Career Academy (CTAE Advisory Committee).  Originally from Statesboro, Georgia, Hillary graduated summa cum laude from Agnes Scott College with a B.A. in History and earned her J.D. from Georgia State University. When not travelling, she lives in Covington with her daughter and husband, an educator in the Newton County School System."
		},
		{
			"name": "Loucy Hay",
			"bio": "Loucy Hay is an active community volunteer and ardent public school supporter.  She was founding chairperson of the Newton Education Foundation and led a small group of parents in developing Newton County Theme School.  Mrs. Hay has served as chairperson of numerous community organizations including the Covington YMCA and the Newton Medical Center Auxiliary. She and her husband, Sam, work together as commercial real estate developers. A graduate of Agnes Scott College, Mrs. Hay serves the institution as a trustee. Mr. and Mrs. Hay are the proud parents of two children, Sam and Allie, who are students in the Newton County School System."
		},
		{
			"name": "Melissa Jackson",
			"bio": "Melissa Jackson is the Instructional Technology Coordinator for Newton County Schools. She has 17 years of educational experience. Prior to working as the County Instructional Technology Coordinator, she taught in the middle school classroom and served as a Technology Teacher Leader. She now works with each of the Technology Teacher Leaders to assist them in building strong Support Teams that will assist teachers in embedding technology into the classroom curriculum and building engaging lessons in order to reach every student. Melissa strongly believes that true 21st century learning should provide a learning environment rich in technology in which every member is valued by a global audience, in which discovery, creation, and publishing are the key components to learning. She is passionate about the development of students and staff through effective professional development and creating powerful learning communities rich in technology. <br><br> Melissa has a large family in the Covington area and is proud to be a member of the Covington community. She has been married for 20 years and has 2 boys that are products of the Newton County School System. Wyatt is 19 and is in the electrical apprenticeship  program for the IBEW and Gunner is 14 and a student at Cousins Middle School. She enjoys spending time with her family and reading a good book."
		},
		{
			"name": "Jimmy Tanner",
			"bio": "Jimmy Tanner serves as Vice President of Business Development and Retail Sales for Newton Federal Bank. He is responsible for leading a team to grow the bank’s consumer and commercial business through sales, marketing, and outside calling efforts. He is also very involved with the bank’s community involvement and service strategies. <br><br> Jimmy is proud to call Covington his hometown, and is very active in his local Chamber of Commerce, as well as his local community, serving on numerous boards and committees. In January of 2015 he was honored as the 2014 Spirit of Excellence Award winner by the Newton County Chamber of Commerce. Jimmy and his wife Saba are proud parents of Nick, a United States Marine, and Sydnie, a Junior at Eastside High School with a passion and gift for music. "
		},
		{
			"name": "Tina Ulmer",
			"bio": "Tina Ulmer is a well-known realtor, event planner and tireless philanthropist and most importantly – a wife to Craig Ulmer and a mother with an ever-growing list of talents. Looking for a great community to raise children, Tina and Craig decided Newton County was the perfect place in 2000. Tina Ulmer, also has an established career as a realtor, having focused on her real estate career for the past 20 years. Tina is passionate about making future homeowners’ dreams come true. When not working as a New Homes Agent for Green River Builders, philanthropy is Tina Ulmer’s passion. She is well known in Newton County as a visionary who, works to develop children as intellectual, creative, confident young people. She feels it’s her responsibility to reach out, and in her words, “foster a global sense of involvement”. <br><br> While philanthropy is her life’s passion, Tina takes time to enjoy some healthy indulgences as well. Her personal interests include spending time with her family, cooking, traveling, crafting, reading, and gourmet food. Always one to promote giving back to her community, Tina emphasizes philanthropic work with her daughters and teaches them about the responsibility she feels she has to the community, leaving each place a little better than she found it."
		},
		{
			"name": "Gary Shattuck",
			"bio": "Gary Shattuck has been the Director of Technology for Newton County Schools for 15 years. Dr. Shattuck has implemented interactivity in every classroom, BYOD in every school, and cameras in 90% of the classrooms. He has implemented a Summer Technology Conference for his teachers and an Innovation Expo to spur creative thinking in the classroom. He created a new PL model for technology implementations. He oversaw the build-out of a 10 GB network and serves as President of the GAMEIS organization and as President of the Georgia K-12 CTO Council."
		},
		{
			"name": "Kathy Nealy",
			"bio": "Kathy Nealy is a full-time mother of three and community volunteer.  She is an active member of the East Newton Elementary PTO where she currently serves as the Vice President and Treasurer.  The majority of her volunteer efforts center on her passion for Girl Scouting.  As the Registrar and Troop Organizer for Newton County, her primary responsibilities include motivating young girls and adults to join Scouting, forming local Troops to enhance their experience, and working with volunteers to ensure continued Troop success.  Additionally, she leads two active Girl Scout troops for elementary and middle school aged girls.  Prior to her full-time volunteer roles, Kathy was a certified Human Resources professional within the local manufacturing industry.  She holds a Bachelor Degree in Economics and a Master Degree in Personnel and Employment Relations."
		},
		{
			"name": "Anjela Ellis",
			"bio": "Anjela Ellis is a lifelong resident of Newton County and graduated from Newton County High School. Anjela is a Market Leader / Loan Officer for BB&T where she manages 2 out of the 3 Covington branches. She started out as a teller with Bank of Covington, then merged with Main Street Bank, and was then was brought into BB&T through the merger. Ellis has been providing customer service for the Covington area for over 19 years. Anjela serves as a board member for the Newton Education Foundation and is very active in the community. She works closely with Relay for Life as she herself is a cancer survivor. Anjela and her husband Thomas are very involved in the Newton County School System where both of their daughters attend school."
		}
	]
}